In [1]:
import pandas as pd
import numpy as np

# Generating a Data Frame

In [2]:
df = pd.read_csv('../Panda/mastermind.csv') 
df = pd.read_csv('mastermind.csv') #Aquí se pone la path o ruta del archivo, como está en la misma carpeta 
                                   #la ruta relativa es solo el nombre del archvi

In [3]:
df

   Unnamed: 0          nombre         especialidad  edad  visitas sexo
0           0       SFDX Show             Hardware    30   130855    H
1           1     Sara Nogark     Edición de vídeo    29   114175    M
2           2    Nate Gentile         Programación    31   142545    H
3           3       Bettatech         Programación    31   149462    H
4           4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5           5      Edgar Pons             Robótica    29   143620    H
6           6         s4vitar              Hacking    28   132567    H

Por defecto genera una columna de índice nueva, no obstante en algunos casos tenemos ya nuestro propio índice creador (Como en esta caso en la columna Unnamed) y podemos decirle que lo use.

In [4]:
df = pd.read_csv('mastermind.csv', index_col ='nombre')

In [5]:
df

                Unnamed: 0         especialidad  edad  visitas sexo
nombre
SFDX Show                0             Hardware    30   130855    H
Sara Nogark              1     Edición de vídeo    29   114175    M
Nate Gentile             2         Programación    31   142545    H
Bettatech                3         Programación    31   149462    H
Antonio Sarosi           4  Sistemas Operativos    28   132008    H
Edgar Pons               5             Robótica    29   143620    H
s4vitar                  6              Hacking    28   132567    H

In [6]:
df = pd.read_csv('mastermind.csv', index_col = [0]) #O indicarle que sea la primera columna, ya que en nuestro caso no tiene nombre

In [7]:
df

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

In [8]:
df['especialidad']

0               Hardware
1       Edición de vídeo
2           Programación
3           Programación
4    Sistemas Operativos
5               Robótica
6                Hacking
Name: especialidad, dtype: object

In [9]:
type(df['especialidad'])

pandas.core.series.Series

Desde un diccionario

In [10]:
list(df['especialidad'])

['Hardware',
 'Edición de vídeo',
 'Programación',
 'Programación',
 'Sistemas Operativos',
 'Robótica',
 'Hacking']

In [11]:
datos = {'nombre': ['SDFX Show', 'Sara Nogark',  'Nate Gentile', 'Bettatech', 'Antonio Sarosi', 'Edgar Pons', 's4vitar'],
                    'especialidad': list(df['especialidad']), 
                     'edad' : [np.random.randint(28, 31) for i in range(len(df['nombre']))], 
                     'visitas': [np.random.randint(100000, 150000) for i in range(len(df['nombre']))] }  #Se le da formato list para evitar 
                                                                # Problemas de compatibilidad

In [12]:
df_inventado = pd.DataFrame(datos)
df_inventado

           nombre         especialidad  edad  visitas
0       SDFX Show             Hardware    30   128516
1     Sara Nogark     Edición de vídeo    28   149392
2    Nate Gentile         Programación    29   124487
3       Bettatech         Programación    30   132993
4  Antonio Sarosi  Sistemas Operativos    29   115295
5      Edgar Pons             Robótica    29   103643
6         s4vitar              Hacking    30   149973

In [13]:
df_inventado['sexo'] = ['H', 'M', 'H', 'H', 'H', 'H', 'H']

In [14]:
df_inventado

           nombre         especialidad  edad  visitas sexo
0       SDFX Show             Hardware    30   128516    H
1     Sara Nogark     Edición de vídeo    28   149392    M
2    Nate Gentile         Programación    29   124487    H
3       Bettatech         Programación    30   132993    H
4  Antonio Sarosi  Sistemas Operativos    29   115295    H
5      Edgar Pons             Robótica    29   103643    H
6         s4vitar              Hacking    30   149973    H

# Explorando un DataFrame

## df.head()

In [15]:
df.head(2) #Muestra por defecto, si no se le da un número, los 4 primeros valores de data frame

        nombre      especialidad  edad  visitas sexo
0    SFDX Show          Hardware    30   130855    H
1  Sara Nogark  Edición de vídeo    29   114175    M

## df.tail()

In [16]:
df_inventado.tail(2)

       nombre especialidad  edad  visitas sexo
5  Edgar Pons     Robótica    29   103643    H
6     s4vitar      Hacking    30   149973    H

## df.info()

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   nombre        7 non-null      object
 1   especialidad  7 non-null      object
 2   edad          7 non-null      int64
 3   visitas       7 non-null      int64
 4   sexo          7 non-null      object
dtypes: int64(2), object(3)
memory usage: 336.0+ bytes

In [18]:
df.sample(3) #Random Sample (By defect just 1)

       nombre  especialidad  edad  visitas sexo
3   Bettatech  Programación    31   149462    H
0   SFDX Show      Hardware    30   130855    H
5  Edgar Pons      Robótica    29   143620    H

In [19]:
df.describe() #Te da datos, número de muestras, media, desviación estandar, min y quartiles, max

            edad        visitas
count   7.000000       7.000000
mean   29.428571  135033.142857
std     1.272418   11590.990631
min    28.000000  114175.000000
25%    28.500000  131431.500000
50%    29.000000  132567.000000
75%    30.500000  143082.500000
max    31.000000  149462.000000

In [20]:
df.describe()['edad']['max']

31.0

## df.shape

In [21]:
df.shape

(7, 5)

In [22]:
df.columns

Index(['nombre', 'especialidad', 'edad', 'visitas', 'sexo'], dtype='object')

In [23]:
df.columns = ['nombre', 'especialidad', 'años', 'visitas', 'sexo']

In [24]:
df

           nombre         especialidad  años  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

In [25]:
df.index

Index([0, 1, 2, 3, 4, 5, 6], dtype='int64')

# Selección de elementos (Subset)

## Acceso mediante etiquetas

In [28]:
#df[columna][fila]

           nombre         especialidad  años  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H

In [30]:
df['especialidad'][2] #Acceder al valor en la posición 2 especialidad, un corchete es una condición.

'Programación'

In [37]:
df['nombre'] == 'Nate Gentile'  #Genera el mapa Booleano para saber que datos tiene que mostrar

0    False
1    False
2     True
3    False
4    False
5    False
6    False
Name: nombre, dtype: bool

In [35]:
df[df['nombre'] == 'Nate Gentile'] #Seleccionas lo que quieres

         nombre  especialidad  años  visitas sexo
2  Nate Gentile  Programación    31   142545    H

In [38]:
df[df['nombre'] == 'Nate Gentile'] ['especialidad']

2    Programación
Name: especialidad, dtype: object

In [42]:
df[df['años'] == 29 ] ['nombre']

1    Sara Nogark
5     Edgar Pons
Name: nombre, dtype: object

## df.iloc[]

In [43]:
#Buscar por índice de columnas e índice del indíce

In [44]:
df.head(5)

           nombre         especialidad  años  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H

In [49]:
df.iloc[0,1]

'Hardware'

In [51]:
df.iloc[2,0:2] #Te permite seleccionar rangos, es no inclusivo así que 0:2 nos da 0 y 1

nombre          Nate Gentile
especialidad    Programación
Name: 2, dtype: object

## df.loc

In [53]:
df.loc[2, 'especialidad':'visitas']

especialidad    Programación
años                      31
visitas               142545
Name: 2, dtype: object

In [54]:
df.loc[2, 'especialidad':] #Si no especificas nada va hasta el final

especialidad    Programación
años                      31
visitas               142545
sexo                       H
Name: 2, dtype: object

In [55]:
df.loc[2, :'especialidad'] #O desde el principio (las etiquetas si son inclusivas)

nombre          Nate Gentile
especialidad    Programación
Name: 2, dtype: object

# Manipulación de datos

## Cambiar Indice

### df.set_index[]